from machine import Pin
import time
from systimer import systimer

#===============================================================================
# ハードウェアの設定
#===============================================================================
led = Pin(25, Pin.OUT)
button = Pin(14, Pin.IN, Pin.PULL_UP)
systimer = systimer()

#===============================================================================
# 定数
#===============================================================================
INTERVAL_SLOW_DEFAULT = 40   # x 10msec, 0x28, XORで値を変えられる絶妙な値設定(^ ^)
INTERVAL_FAST_DEFAULT = 8    # x 10msec, 0x08
LONG_PRESS_DETECT_TIME = 100 # x 10msec スイッチが押されてから長押しとみなすまでの時間

#===============================================================================
# 書き換えてほしくない変数
#===============================================================================
_switch_scan_shiftReg = 0
_flash_count = 0
_switch_push_count = 0

#===============================================================================
# 自由に書き換えてもいい変数
#===============================================================================
flash_interval = INTERVAL_SLOW_DEFAULT    #点滅の間隔（systimerの割り込み回数）

#===============================================================================
# イベント
#===============================================================================
# スイッチが押されたイベント
def switch_pushed():
    global flash_interval
    
    print("スイッチが押されました！")
    #---------------------------------------------------------------------------
    # スイッチが押された時の処理をここに書いてください
    #---------------------------------------------------------------------------
    flash_interval ^= 0x20
    # if flash_interval == INTERVAL_SLOW_DEFAULT:
    #    flash_interval = INTERVAL_FAST_DEFAULT
    # else:
    #    flash_interval = INTERVAL_SLOW_DEFAULT

# スイッチが離されたイベント
def switch_released():
    print("スイッチが離されました！")
    #---------------------------------------------------------------------------
    # スイッチが離された時の処理をここに書いてください
    #---------------------------------------------------------------------------

# スイッチ長押しを検出したイベント
def switch_long_pushed():
    print("スイッチが長押しされました！")
    #---------------------------------------------------------------------------
    # スイッチが長押しされた時の処理をここに書いてください
    #---------------------------------------------------------------------------

def switch_long_released():
    print("スイッチ長押しが解除されました！")
    #---------------------------------------------------------------------------
    # スイッチの長押しが解除された時の処理をここに書いてください
    #---------------------------------------------------------------------------

#===============================================================================
# メインループ
#===============================================================================
while True:
    if systimer.interruptCt() != 0: #10msecごとに割り込みが発生しているなら
        #-----------------------------------------------------------------------
        # 書き換えないで！スイッチ入力監視
        #-----------------------------------------------------------------------
        _switch_scan_shiftReg <<= 1
        _switch_scan_shiftReg &= 0x00ff

        if button.value() == 0:
            _switch_scan_shiftReg |= 0x01

        #-----------------------------------------------------------------------
        # 書き換えないで！イベント生成
        #-----------------------------------------------------------------------
        if _switch_scan_shiftReg == 0x7f:   #スイッチが押された
            _switch_push_count += 1 #長押しの監視開始
            switch_pushed()                 #スイッチが押されたイベント発生

        if _switch_scan_shiftReg == 0x80:   #スイッチが離された
            if _switch_push_count >= LONG_PRESS_DETECT_TIME:    #長押しされていたなら
                switch_long_released()
            _switch_push_count = 0  #長押しの監視終了
            switch_released()               #スイッチが離されたイベント発生
            
        if _switch_push_count > 0:
            _switch_push_count += 1
            if _switch_push_count == LONG_PRESS_DETECT_TIME: #スイッチが押されてから長押しとみなす時間経過しているなら
                switch_long_pushed()

        #-----------------------------------------------------------------------
        # 自由に書き換えてもいい処理
        #-----------------------------------------------------------------------
        _flash_count += 1
        _flash_count %= flash_interval
        
        if _flash_count == 0:
            led.toggle()#点灯/消灯を切り替える
